package com.example.finalproject;

public class DataBase {


    static String[] name1 = {"קובה במיה","פיצה ביאנקה", "סטייק אנטריקוט", "עוגת קראנץ' שוקולד", "המבורגר ", "פסטה עגבניות", "כרובית מטוגנת", "בורקס בשר",
            "סלט חלומי", "פנקייקים" , "מוקפץ" ,"סושי" , "ניוקי" ,"פוקאצ'ה" ,"עוף בתנור" , "ג'חנון" , "סלט יווני" ,"מפרום"};

    static String[] recipeIngredients1 = {"למרק:\n" +
            "1/2 ק\"ג במיה טרייה או קפואה\n" +
            "3 כפות שמן\n" +
            "1 בצל קטן, קצוץ דק\n" +
            "2 כפות רסק עגבניות\n" +
            "2 עגבניות מקולפות, מגוררות בפומפייה גסה\n" +
            "מלח לפי הטעם\n" +
            "1/4 כפית פלפל שחור גרוס\n" +
            "1/4 כוס מיץ לימון טרי\n" +
            "2 כפות סוכר\n" +
            "3 כוסות מים חמים\n" +
            "למילוי:\n" +
            "250 גרם בשר בקר טחון או עוף טחון\n" +
            "1 בצל קטן קצוץ\n" +
            "1 כפית שמן\n" +
            "1 כפית פטרוזיליה קצוצה\n" +
            "1/4 כפית מלח\n" +
            "1/4 כפית פלפל שחור\n" +
            "למעטפת:\n" +
            "1 כוס סולת\n" +
            "1 כפית שטוחה מלח\n" +
            "1 כפית שמן\n" +
            "1/3 כוס מים פושרים","לבצק הפיצה\n" +
            "חצי קילו קמח פיצה\n" +
            "כוס וחצי מים פושרים\n" +
            "כפית שמרים יבשים\n" +
            "4 כפות שמן זית\n" +
            "1 כפית שטוחה מלח דק\n" +
            "רוטב ביאנקה\n" +
            "2 מיכלים שמנת מתוקה 38% (500 מ”ל)\n" +
            "קורט אגוז מוסקט טחון\n" +
            "פלפל שחור גרוס\n" +
            "מלח\n" +
            "150 גרם גבינת פרמזן מגוררת\n" +
            "150 גרם מוצרלה מגוררת\n" +
            "6 פטריות טריות פרוסות דק", "נתח אנטרקוט במשקל 450 גרם\n" +
            "מלח גס\n" +
            "פלפל שחור גרוס טרי\n" +
            "שמן זית\n" +
            "ענף רוזמרין שלם\n" +
            "קוביית חמאה (לא חובה\n" +
            "½ כוס יין אדום יבש באיכות טובה\n" +
            "3 בצלצלי שאלוט קצוצים\n" +
            "20 גרם חמאה / שמן זית / שומן אווז\n" +
            "מלח ים גס\n" +
            "פלפל שחור גרוס טרי\n" +
            "3 גרגרי ערער (מועכים אותם בזבנג עם להב הסכין)", "לבצק\n" +
            "5.5 כוסות קמח (770 גרם)\n" +
            "3/4 כוס סוכר (150 גרם)\n" +
            "1/2 שקית שמרים יבשים או חצי קובייה של שמרים טריים\n" +
            "3/4 שקית משפר אפייה\n" +
            "3 ביצים גדולות (מס' 1)\n" +
            "3/4 כוס מים פושרים (180 מ\"ל)\n" +
            "1 כפית תמצית וניל\n" +
            "קליפת לימון מגוררת מרבע לימון\n" +
            "175 גרם חמאה רכה חתוכה לקוביות בגודל 2 ס\"מ\n" +
            "1/2 כפית מלח\n" +
            "למלית\n" +
            "750 גרם ממרח שוקולד\n" +
            "150 גרם עוגיות חמאה מפוררות דק או 150 גרם אגוזי מלך קצוצים דק במעבד מזון\n" +
            "לסירופ סוכר (לא חובה)\n" +
            "1/2 כוס מים (120 מ\"ל)\n" +
            "3/4 כוס סוכר (150 גרם)\n" +
            "1/2 כפית תמצית וניל\n" +
            "קורט מלח לימון או כפית מיץ לימון",
            "500 גרם בשר בקר טחון\n" +
                    "\n" +
                    "2 בצלים בינוניים-גדולים\n" +
                    "\n" +
                    "1 כף חרדל גדושה\n" +
                    "\n" +
                    "1 כפית מלח\n" +
                    "\n" +
                    "1/4 כפית פלפל שחור\n" +
                    "\n" +
                    "1/4 כוס מי סודה מוגזים\n" +
                    "\n" +
                    "1/3 כפית כמון (לא חובה- רק למי שאוהב את הניחוח והטעם)", "1 בצל קצוץ דק דק דק,\n" +
            "1/4 כוס שמן,\n" +
            "2 שיני שום כתושות,\n" +
            "כפית פפריקה אדומה מתוקה,\n" +
            "1/4 כפית כמון,\n" +
            "1/4 כפית פלפל שחור,\n" +
            "1 כפית מלח,\n" +
            "4 כפות רסק עגבניות (בערך 2 קופסאות קטנות),\n" +
            "1 כפית סוכר,\n" +
            "2 עגבניות טריות – מגורדות בפומפייה (או 1/2 פחית של פסאטה / עגבניות מרוסקות),\n" +
            "כוס מים רותחים.", "1 כרובית גדולה\n" +
            "1 כף כורכום\n" +
            "1 כף מלח גס\n" +
            "אפשרות: 1/2 1 כוסות פירורי לחם, מעורבבים עם 1/2 כפית מלח, 1/2 כפית פלפל שחור ו-1 כפית כורכום\n" +
            "שמן לטיגון\n" +
            " \n" +
            "\n" +
            "לבלילה\n" +
            "4 ביצים\n" +
            "1 כפית מלאה כורכום\n" +
            "1/2 כפית פפריקה\n" +
            "1 כפית מלח\n" +
            " \n" +
            "\n" +
            "לרוטב\n" +
            "1/4 כוס חרדל\n" +
            "2 כפות דבש\n" +
            "1 כפית שמן זית." , "1 חבילת בצק עלים \n" +
            "ביצה להברשה\n" +
            "שומשום וקצח \n" +
            "למילוי:\n" +
            "3-4 כפות שמן זית\n" +
            "1 בצל, קצוץ דק\n" +
            "500 גרם בשר בקר טרי טחון\n" +
            "חופן פטרוזליה קצוצה (לא חובה)\n" +
            "מעט תימין טרי  \n" +
            "2-3 שיני שום, קצוצות\n" +
            "מעט צ'ילי חריף\n" +
            "כפית תבלין בהרט או ראס אל חנות או כמון\n" +
            "מלח\n" +
            "פלפל שחור" , "200 גרם גבינת חלומי\n" +
            "חצי סלסלת מארז דואט פטריות (חוות השמפיניון)\n" +
            "2 מלפפונים\n" +
            "עגבניות שרי\n" +
            "גזר\n" +
            "עלי חסה\n" +
            "30 גרם אגוזי מלך\n" +
            "30 גרם תערובת גרעינים קלויים\n" +
            "רוטב טריאקי\n" +
            "רוטב ויניגרט" , "לכ-14 פנקייקס בקוטר של כ-8-9 ס\"מ:\n" +
            "כוס וחצי קמח רגיל\n" +
            "כפית ושלושת רבעי אבקת אפייה\n" +
            "3 כפות סוכר\n" +
            "חצי כפית מלח\n" +
            "ביצה, טרופה\n" +
            "3 כפות (45 גרם) חמאה מומסת\n" +
            "כוס-כוס ורבע חלב" , "250 גרם אטריות (לפני בישול) מכל סוג\n" +
            "2 כפות שמן\n" +
            "למוקפץ:\n" +
            "3 כפות שמן (מכל סוג)\n" +
            "5- 4 שיני שום כתושות\n" +
            "1 כפית גדושה ג'ינג'ר טרי מגורד\n" +
            "1/2 כפית פתיתי צ'ילי חריף (לא חובה)\n" +
            "1 כף דבש/סוכר חום/ מירין\n" +
            "1 גזר בינוני פרוס לרצועות דקות\n" +
            "1 פלפל אדום בינוני פרוס לפרוסות דקות\n" +
            "1 אריזת נבטים סיניים (250 גרם)\n" +
            "5 כפות רוטב סויה אמיתי\n" +
            "בצל ירוק/כוסברה לקישוט (לא חובה)",
            "לשמונה רולים:\n" +
                    "4 כוסות אורז עגול\n" +
                    "4 1/2כוסות מים.\n" +
                    "1/2כוס חומץ אורז.\n" +
                    "2כפות גדושות סוכר לבן.\n" +
                    "1כף מלח דק.\n" +
                    "1חבילה אצות נורי.\n" +
                    "2מלפפונים בינוניים חתוכים לרצועות דקות ללא החלק הפנימי.\n" +
                    "1אבוקדו בינוני בשל מקולף וחתוך לרצועות דקות.\n" +
                    "100גרם פילה דג סלמון נקי מעצמות ומעור חתוך לרצועות דקות.\n" +
                    "1חופן עירית או בצל ירוק חתוך לרצועות דקות.\n" +
                    "רטבים : ספייסי מיונז ,רוטב טריאקי ,רוטב סויה." , "3-4 כפות שמן זית.\n" +
            "3-4 שיני שום, קלופות ופרוסות דק.\n" +
            "חופן גדול עגבניות שרי, חצויות.\n" +
            "מלח ופלפל שחור גרוס. \n" +
            "בערך 400 גרם ניוקי מוכן.\n" +
            "מי בישול של הניוקי.\n" +
            "עלים מ4-5 גבעולי בזיליקום, קצוצים גס.\n" ,"1 ק\"ג קמח לבן ללחם\n" +
            "11 גרם שמרים יבשים (כף גדושה)\n" +
            "22 גרם מלח ים דק (כף ועוד טיפה)\n" +
            "45 גרם סוכר (4 כפות)\n" +
            "2 כפות שמן זית\n" +
            "680 גרם מים (3 כוסות פחות 3 כפות)\n" +
            "מעל הפוקצ'ה:\n" +
            "שמן זית בנדיבות\n" +
            "רוזמרין\n" +
            "מלח ים אטלנטי" , "\n" +
            "6 כרעיים עם העור\n" +
            "חבילת בצלי שאלוט עם הקליפה\n" +
            "ראש שום שלם מפורק עם הקליפה\n" +
            "לתפוחי האדמה הצלויים\n" +
            "6 תפוחי אדמה שטופים עם הקליפה וחתוכים לחתיכות גסות וגדולות\n" +
            "חצי כוס שמן זית\n" +
            "מלח ופלפל\n" +
            "למרינדת העוף\n" +
            "מיץ של 2 לימונים\n" +
            "שלושת רבעי כוס סויה\n" +
            "5 שיני שום כתושים\n" +
            "חצי פלפל חריף ירוק קצוץ (למי שאוהב)\n" +
            "3 כפות גדושות דבש\n" +
            "שליש כוס רוטב טריאקי\n" +
            "כפית פלפל שחור" , "לבצק:\n" +
            "קילו קמח רב תכליתי (ניתן גם להשתמש בקמח לחם)\n" +
            "4 כפות סוכר\n" +
            "3 כפות דבש או סילאן\n" +
            "כף שטוחה של מלח\n" +
            "2 וחצי עד 3 כוסות מים\n" +
            " \n" +
            "לעיצוב:\n" +
            "חצי כוס שמן לשימון הבצק\n" +
            "100 גרם חמאה מומסת (אפשר גם מרגרינה)" , "4 עגבניות אדומות ובשלות מאוד\n" +
            "5 מלפפונים קלופים\n" +
            "2 בצלים סגולים (או לבנים)\n" +
            "½ פלפל ירוק\n" +
            "½ כוס זיתים שחורים\n" +
            "200 גרם גבינה פטה או בולגרית, לא רכה מדי\n" +
            "קורט נדיב של אורגנו מיובש"
            };

    static String[] RecipeMethodTitle1 = {"אופן הכנה", "אופן הכנה", "אופן הכנה",
            "אופן הכנה", "אופן הכנה", "אופן הכנה", "אופן הכנה", "אופן הכנה", "אופן הכנה" , "אופן הכנה", "אופן הכנה" , "אופן הכנה" , "אופן הכנה" , "אופן הכנה" , "אופן הכנה" , "אופן הכנה" , "אופן הכנה" ,  "אופן הכנה"};
    static String[] recipe1 = {"1. מכינים את הבמיה לבישול: שוטפים אותה ומייבשים היטב על מגבת. מסירים בעדינות את קצה העוקץ ומקפידים לא לפגוע בירק.\n" +
            "\n" +
            "2. מכינים את המרק: יוצקים שמן לסיר ומטגנים בו את הבצל עד שהוא מתחיל להזהיב. מוסיפים את הבמיה ומטגנים במשך 5 דקות עד שהיא נצרבת קלות. מוסיפים את רסק העגבניות ואת העגבניות המגוררות, מערבבים ומאדים במשך 2 דקות נוספות. מוסיפים את המלח, הפלפל השחור, מיץ הלימון והסוכר ומערבבים. יוצקים מים, מרתיחים, מנמיכים את האש ומבשלים במשך 5 דקות נוספות.\n" +
            "\n" +
            "3. מרכיבים את המילוי: מערבבים את כל החומרים עד קבלת תערובת אחידה. מניחים בצד.\n" +
            "\n" +
            "4. מכינים את המעטפת: בקערה גדולה מערבבים את הסולת, המלח והשמן. יוצקים מים בהדרגה עד קבלת תערובת אחידה ודלילה מעט. אם צריך אפשר להוסיף מעט מים. מכסים וממתינים במשך 20 דקות עד שהמים נספגים ונוצר בצק רך וגרגירי.\n" +
            "\n" +
            "5. מרכיבים את הקובות בידיים רטובות: קורצים מתערובת הסולת כדור בגודל כדור פינג-פונג ומשטחים אותו על כף היד. נוטלים כפית גדושה מתערובת הבשר ומניחים במרכזו. סוגרים את הקצוות מסביב למילוי ומגלגלים בעדינות לכדור חלק. מניחים במגש. כך ממשיכים עם כל תערובת הסולת.\n" +
            "\n" +
            "6. מבשלים את הקובות: מטילים בזהירות את כדורי הקובה לסיר המרק. כעבור כדקה מוסיפים עוד קובות וכך הלאה, עד גמר הקובות. מטלטלים את הסיר בעדינות רבה כדי שלא יידבקו זו לזו או לתחתית הסיר. מרתיחים ומבשלים במשך כ-5 דקות על אש גדולה. מנמיכים את האש ומבשלים במשך כרבע שעה נוספת. טועמים, מתקנים תיבול ומגישים.","הבצק:\n" +
            "1. מערבבים במיקסר וו גיטרה: קמח, שמרים יבשים וסוכר.\n" +
            "2. מוסיפים שמן מלח ובהדרגה גם את המים עד לקבלת בצק חלק וגמיש.\n" +
            "3. יוצרים מהבצק כדור ומניחים בקערה מכוסה להתפחה של שעתיים (לפחות).\n" +
            "4. לאחר ההתפחה לשים מעט ידנית את הבצק ומרדדים לצורה עגולה על נייר אפיה מקומח.\n" +
            "5. מומלץ – לחורר את הבצק עם מזלג.\n" +
            "\n" +
            "הכנת הרוטב:\n" +
            "1. בסיר קטן מערבבים את מרכיבי הרוטב- שמנת ותבלינים, מבשלים על אש נמוכה בינונית כ 25 דקות, תוך כדי ערבוב עד שהשמנת מצטמצמת ומסמיכה. מניחים בצד להתצטננות.\n" +
            "\n" +
            "מרכיבים את הפיצה:\n" +
            "1. מחממים תנור ל 190 מעלות ומניחים תבנית הפוכה בתוכו שתתחמם\n" +
            "2. מורחים על הבצק את הרוטב בנדיבות ומפזרים גבינות ופרוסות ארטישוק על גבי הפיצה\n" +
            "3. מניחים את הפיצה על גבי התבנית ההפוכה בתנור (בחלק התחתון של התנור) ל 10 דקות\n" +
            "4. מוציאים מהתנור, מפזרים בזיליקום, מחכים 5 דקות שהפיצה מעט תצטנן וזוללים.", "הכנת הסטייק:\n" +
            "1.מלהיטים את המחבת.\n" +
            " 2. מתבלים את הסטייק במעט מלח גס ופלפל שחור גרוס טרי.\n" +
            " 3. יוצקים למחבת מעט שמן זית.\n" +
            " 4. מניחים את הסטייק ועוזבים בשקט למשך דקה–דקה וחצי.\n" +
            " 5. באותו הצד מסובבים את הסטייק על המחבת 90 מעלות כדי לקבל דוגמת פסי צלייה שתי וערב. צולים 40 שניות.\n" +
            " 6. הופכים את הסטייק – וחוזרים על 2 הפעולות.\n" +
            " 7. בעזרת מלקחיים מעבירים את הסטייק לתבנית תנור, מניחים עליו ענף רוזמרין שלם, אם רוצים גם קוביית חמאה, ומכניסים לתנור שחומם מראש לחום של 220 מעלות, למשך 5- 3 דקות.\n" +
            "\n" +
            "הכנת רוטב יין פשוט:\n" +
            "1.בעזרת נייר סופג מנגבים רק את עודפי השומן ממחבת הפסים שבה צלינו את הסטייק.\n" +
            " 2. מחממים את המחבת, מכניסים אליה את בצלצלי השאלוט וחצי מהחמאה ומאדים קלות.\n" +
            " 3. מוסיפים את גרגרי הערער וממשיכים לאדות.\n" +
            " 4. מוסיפים את היין ובעזרת כף עץ מקרצפים את שאריות מיצי הסטייק מהמחבת.\n" +
            " 5. מבשלים עד שהיין מצטמצם.\n" +
            "6. מכבים את האש ומוסיפים את שאר החמאה.\n" +
            " 7. מעבירים את הרוטב דרך מסננת.\n" +
            " 8. מוסיפים מעט מלח ופלפל שחור.\n" +
            "\n" +
            "ההגשה: מוציאים את הסטייק מהתנור ומעבירים לצלחת הגשה. יוצקים את הרוטב.", "לסירופ:\n" +
            "1. מביאים לרתיחה את המים והסוכר בסיר קטן. מנמיכים את הלהבה, מוסיפים תמצית וניל ומלח לימון ומבשלים ללא כיסוי כ-2 דקות. מצננים ושומרים במקרר.\n" +
            "\n" +
            "לבצק:\n" +
            "1. מערבלים את הקמח, הסוכר, השמרים ומשפר האפייה במיקסר עם וו לישה. מוסיפים ביצים, מים, תמצית וניל וקליפת לימון מגוררת לימון ומערבלים במשך כ-2 דקות עד לקבלת תערובת אחידה.\n" +
            "\n" +
            "2. מוסיפים קוביות חמאה אחת-אחת עד שהן נבלעות בתערובת ולשים כ-7 דקות, עד לקבלת בצק רך ומעט דביק. מוסיפים מלח ולשים כדקה נוספת. מעבירים את הבצק לקערה מקומחת, מכסים בניילון נצמד ומכניסים למקרר ל-4 שעות.\n" +
            "\n" +
            "3. מחלקים את הבצק ל-3 חלקים ומרדדים כל חלק על משטח מקומח למלבן בעובי ½ ס\"מ. מורחים ממרח שוקולד בצורה שווה ומפזרים פירורי עוגיות ואגוזים קצוצים. בצד הבצק הקרוב אלינו יוצרים מכפלת קטנה ומתחילים לגלגל. תוך כדי גלגול מושכים את הבצק אלינו (לכיוון ההפוך) - המשיכה מבטיחה שיתקבל גליל הדוק בעובי אחיד.\n" +
            "\n" +
            "4. חוצים את הגליל לאורכו בעזרת סכין חלק. מניחים את שני חצאי הגליל זה על זה בצורת X כשצדם הפתוח פונה לאותו כיוון, מלפפים לצמה ומהדקים בקצוות.\n" +
            "\n" +
            "אפייה:\n" +
            "1. מניחים את הצמות בתבנית אפייה משומנת, מברישים בביצה ומתפיחים כ-45 דקות. מחממים תנור ל-170 מעלות. אופים כ-35 דקות עד להזהבה קלה. מוציאים את הקראנצים מהתנור ומברישים בסירופ בעודם חמים (הסירופ צריך להיות קר).",
            "1. מטגנים בצל במחבת עד שהבצל נהיה שקוף-זהוב ומוציאים למסננת עד שיתקרר מעט.\n" +
                    "\n" +
                    "2. מערבבים בקערה את הבשר, הבצל ואת שאר המצרכים ולשים (לא יותר מדקה).\n" +
                    "\n" +
                    "3. יוצרים קציצות המבורגר בעובי של כס”מ וחצי , ומניחים על מחבת פסים עם מעט שמן (המחבת צריכה להיות חמה מאוד). למידת עשייה מדיום, מטגנים כ-2 דקות מכל צד.\n" +
                    "\n" +
                    "*מומלץ להגיש עם לחמניית המבורגר עגולה, עלי חסה, עגבנייה, בצל ומלפפון חמוץ ,צ'יפס ורטבים.", "1. בסיר גדול וכבד מחממים שמן ובו מטגנים את הבצל על להבה נמוכה כ-7 דקות, עד שהבצל הופך שקוף. מערבבים מידי פעם.\n" +
            "2. מוסיפים שום, פפריקה, כמון, פלפל ומלח ומטגנים דקה אחת ולא יותר.\n" +
            "3. מוסיפים רסק עגבניות, סוכר, עגבניות טריות ומים רותחים ומערבבים היטב.\n" +
            "4. מביאים לרתיחה ומנמיכים להבה, מבשלים את רוטב העגבניות בין 10-15 דקות, לרוטב מרוכז יותר ממתינים עד תום ה-15 דקות בישול.\n" +
            "5. בזמן שהרוטב מתבשל מכינים ספגטי לפי הוראות היצרן, מבשלים עד שהספגטי כמעט מוכן ולא רך מידי, מוציאים למסננת ומעבירים לסיר הרוטב.\n" +
            "6. מערבבים היטב את הספגטי בתוך רוטב העגבניות ומבשלים כ-4 דקות יחדיו.\n" +
            "7. מעבירים לקערה גדולה או צלחות הגשה ונהנים.", "1.מפרקים את הכרוביות לפרחים גדולים.\n" +
            "\n" +
            "2.ממלאים סיר גדול במים, מוסיפים את הכורכום והמלח ומביאים לרתיחה. מוסיפים את פרחי הכרובית, מביאים שוב לרתיחה ומבשלים דקה נוספת. מסננים את פרחי הכרובית, מסדרים אותם על מגבת ומניחים להם להתייבש מעט.\n" +
            "\n" +
            "3.מערבבים את מרכיבי הבלילה בקערית. אם רוצים, מכינים ליד צלחת עם פירורי לחם מתובלים.\n" +
            "\n" +
            "4.מחממים במחבת שמן בעומק של 1 עד 1.5 ס\"מ. טובלים כל פרח כרובית בבלילת הביצה, כך שהיא תכסה אותו היטב, ואם רוצים גם בפירורי לחם. מטגנים עד להזהבה מכל הצדדים ומעבירים לצלחת מרופדת במגבות נייר.\n" +
            "\n" +
            "5.מערבבים את כל מרכיבי הרוטב, טועמים, ואם צריך מתקנים תיבול.\n" +
            "\n" +
            "6.מגישים את פרחי הכרובית החמים עם הרוטב." , "1. מתחילים בהכנת מילוי הבשר: מחממים מחבת עם שמן ומטגנים את הבצל עד הזהבה. מוסיפים את התבלינים והבשר. \n" +
            "\n" +
            "2. מבשלים עד שהבשר מחליף צבע.\n" +
            "\n" +
            "3. מצננים את המילוי ובינתיים פותחים את הבצק על משטח העבודה. מניחים חצי מהבצק כבסיס בתוך תבנית. שופכים מעל את המילוי וסוגרים עם החצי השני של הבצק. \n" +
            "\n" +
            "4. חותכים לקוביות לפני האפייה, מברישים בביצה ובוזקים מעל שומשום וקצח. \n" +
            "\n" +
            "5. מחממים תנור ל-200 מעלות ואופים כ-30 דקות או עד הזהבה. " , "חותכים את גבינת החלומי לקוביות בינוניות, משרים את הגבינה ברוטב טריאקי למשך כ-2 דקות, לבינתיים פורסים את הפטריות לפרוסות דקות. מטגנים את החלומי והפטריות ברוטב טריאקי.\n" +
            "\n" +
            "הרכבת הסלט:\n" +
            "קורעים את עלי החסה לקערת הגשה שטוחה, פורסים את המלפפון לחצאי עיגולים, את עגבניות השרי חותכים לחצי, ומסדרים מעל החסה.\n" +
            "מגררים את הגזר על פומפיה דקה, ומפזרים מלמעלה. מפזרים על הסלט את אגוזי המלך ותערובת הגרעינים. מוסיפים לסלט את גבינת החלומי והפטריות כשהן חמות, יוצקים רוטב ויניגרט ומגישים." , "1. מערבבים את החומרים היבשים בקערה - הקמח, אבקת האפייה, הסוכר והמלח.\n" +
            "\n" +
            "2. בקערה נפרדת מערבבים היטב את הביצה עם החמאה המומסת (והמצוננת מעט) וכוס חלב.\n" +
            "\n" +
            "3. יוצקים את החומרים הרטובים אל תערובת הקמח ומערבבים עם כף עץ, רק עד שהחומרים מתאחדים. לא מתרגשים מגושים. אם אתם רוצים בלילה נוזלית יותר, מוסיפים חלק או את כל רבע כוס החלב הנותרת.\n" +
            "\n" +
            "4. מחממים מחבת גדולה. משמנים אותה עם מעט חמאה או ספריי שמן בטעם חמאה ומנמיכים את האש לבינונית.\n" +
            "\n" +
            "\n" +
            "5. יוצקים בלילה למחבת (בכמות ובגודל הרצויים לכם) ומטגנים כ-2 דקות עד שנוצרות בועיות אוויר על הצד העליון של הפנקייקס והצד התחתון שלהן משחים. הופכים, מטגנים עוד כדקה ומוצאים לצלחת. ממשיכים כך, עד שהבלילה מסתיימת.\n" +
            "\n" +
            "6.מגישים מיד עם סירופ מייפל, דבש, סילאן, סירופ שוקולד, חמאה, חמאת בוטנים ועוד." ,"1. חותכים את הגזר והפלפל האדום לרצועות דקות. אפשר בכל צורה שרוצים אבל חשוב שהחתיכות יהיו דקות כך שיוכלו להתבשל מהר.\n" +
            "\n" +
            "2. מבשלים את האטריות לפי ההוראות על גבי האריזה (אם מדובר באטריות אורז מומלץ לשטוף במים קרים כדי לעצור את הבישול). מערבבים עם 2 כפות שמן שומשום כדי שהאטריות לא ידבקו אחת לשנייה.\n" +
            "\n" +
            "3. לסיר רחב או ווק מוסיפים 3 כפות שמן, שום, ג’ינג’ר ודבש. מקפיצים עד שעולה ריח נעים (זהירות לא לשרוף את השום שמקבל טעם מר). מוסיפים את הירקות ומקפיצים במשך כ-3-4 דקות. מוסיפים את האטריות ואת הרוטב סויה ומערבבים למשך עוד 2-3 דקות. מוסיפים את הנבטים ומערבבים לעוד 2-3 דקות. מקשטים עם כוסברה/בצל ירוק ומגישים.", "מכינים את האורז: משרים את האורז בקערה גדולה עם מים ומסננים היטב עד שהמים יוצאים צלולים.\n" +
            "מכניסים את האורז לסיר, מוסיפים מים, מכסים במכסה ומביאים לרתיחה.\n" +
            "מעבירים את הסיר ללהבה נמוכה וממשיכים לבשל כ-20 דקות עד לריכוך האורז.\n" +
            "במקביל לבישול האורז. ממיסים את הסוכר והמלח בחומץ האורז, אפשר לחמם מעט בכיריים כדי לזרז את התהליך.\n" +
            "מכבים את האורז, משאירים את הסיר מכוסה ומניחים לאורז לנוח כ-15 דקות.\n" +
            "מעבירים את האורז לקערה גדולה, שופכים מעל את החומץ המתובל ומערבבים בזהירות. מניחים לאורז להתקרר.\n" +
            "מכינים את הסושי: עוטפים את המחצלת היטב בניילון נצמד.\n" +
            "מנחים אצה על המחצלת, מעל האצה שכבר דקה של האורז.\n" +
            "בחלק של האצה הקרוב אלינו מניחים את הדג והירקות ומתחילים לגלגל בעזרת המחצלת תוך כדי שמהדקים היטב לאורך כל דרך הגלגול.\n" +
            "חותכים את הרול ל-8 חלקים, מגישים לצד רטבים וזוללים!\n" , "במחבת רחבה שמים את השום ואת שמן הזית. מטגנים מעל להבה בינונית גבוהה בערך דקה עד ששיני השום מתרככות.\n" +
            "מוסיפים את עגבניות השרי ומצקת ממי הבישול של הניוקי. מתבלים במלח ומבשלים 2-3 דקות, עד שהעגבניות מתרככות.\n" +
            "בשלב זה מנמיכים את הלהבה ומבשלים את הניוקי (אם עדיין לא בישלתם אותם)\n" +
            "מוסיפים את הניוקי המבושלים עם עוד 2-3 כפות מי בישול ניוקי. מערבבים בעדינות כדי לצפות את הניוקי ברוטב, אם יבש מדי מוסיפים עוד מי בישול.\n" +
            "מוסיפים את הבזיליקום (ואפשר ואף רצוי עוד 1-2 כפות שמן זית) מערבבים בעדינות ומכבים את האש.\n" +
            "מחלקים למנות ומגישים מיד." , "1. מלהיטים את התנור לטמפרטורה מקסימלית (כ-250 מעלות).\n" +
            "\n" +
            "2. מנפים את הקמח לקערה עמוקה ומוסיפים את השמרים, המלח והסוכר. מערבבים היטב, מוסיפים את שמן הזית ואת כל המים בבת אחת ומערבבים בשתי הידיים במשך 7 דקות.\n" +
            "\n" +
            "3.מכסים את הקערה בניילון נצמד או מגבת לחה, ומניחים ל-45 דקות.\n" +
            "\n" +
            "4. מפילים את הבצק באגרופים עד שכל הנפח יורד, מכסים, ומניחים לתפוח עוד 30 דקות.\n" +
            "\n" +
            "5. מכדררים 6 כדורים ומניחים על משטח מקומח. מגלגלים אותם פעם אחת.\n" +
            "\n" +
            "6. מניחים לכדורים לתפוח 20 דקות. פותחים את הכדורים בין שתי כפות הידיי, מורחים במעט שמן זית ומכניסים לתנור (רצוי על אבן אפייה, סביר שתצטרכו 3 סבבי אפייה). אופים כמה דקות עד שמזהיב.\n" +
            "\n" +
            "7. כשמוציאים מהתנור מזלפים עוד שמן זית ומפזרים מלח ים ורוזמרין טרי קצוץ. מחזירים את הפוקצ'ה לתנור ל-2 דקות. מוציאים ואוכלים." , "1. מערבבים היטב את כל חומרי המרינדה ומכניסים לתוכה את העופות השומים והשאלוט (עם הקליפה) לפחות לשעה.\n" +
            "\n" +
            "2.את תפוחי האדמה מכניסים לתבנית נפרדת. מצפים היטב בשמן זית, מלח ופלפל.\n" +
            "\n" +
            "3.מכניסים לתנור בחום של 200 מעלות לשעתיים או עד שתפוחי האדמה מזהיבים היטב והעוף רך וצבעו שחום ומבריק.\n" +
            "\n" +
            "4. מגישים מיד עם מעט מהרוטב מעל וסלט עגבניות עוקצני בצד.\n" +
            "*אפשר לשים את העוף ואת התפוחי אדמה בתנית אחת, זמני האפייה לא משתנים." , "1. מערבבים את כל החומרים חוץ מהמים בקערת מיקסר עם וו לישה. מוסיפים את המים - בהתחלה 2 כוסות בלבד ואז עוד, לאט לאט, לפי הצורך, עד לקבלת בצק רך וגמיש ולא דביק. מערבלים את הבצק בין הוספה להוספה.\n" +
            "\n" +
            "2. משמנים את החלק העליון של הבצק ומכסים את הקערה במגבת או בניילון נצמד. מניחים לבצק לנוח למשך כשעה.\n" +
            "\n" +
            "3.מחלקים את הבצק לכדורים בגודל שווה (מהכמות הזו יצאו לי 14 כדורים של 110 גרם בערך), מסדרים את הכדורים בתבנית ויוצקים מעליהם ומסביבם את השמן כדי שלא יידבקו. מכסים. מניחים לכדורים לנוח לפחות שעה. ניתן להניח להם לנוח גם כמה שעות או לילה במקרר.\n" +
            "\n" +
            "4. לעיצוב הג'חנונים, מכינים מראש את החמאה המומסת ומפנים מקום על השיש/משטח העבודה.\n" +
            "\n" +
            "5. מרדדים כל כדור למלבן גדול וכמה שיותר דק (השמן עוזר לרידוד), אפשר עם הידיים ואפשר להיעזר במערוך.\n" +
            "\n" +
            "6. מורחים על הבצק שכבה דקה של חמאה מומסת ומתחילים לקפל: מקפלים שליש מהבצק פנימה ומעליו מקפלים את השליש השני ליצירת מלבן ארוך. לאחר מכן מגלגלים את הבצק בעדינות ותוך תנועת מתיחה קלה עד שמתקבל ג'חנון.\n" +
            "\n" +
            "7. מניחים את הג'חנון על המגש המשומן וממשיכים לגלגל את יתר כדורי הבצק.\n" +
            "\n" +
            "8. אם הכנתם את הג'חנונים מראש, מוודאים שכולם משומנים (שלא יתייבשו) מכסים בניילון נצמד ומעבירים למקרר.\n" +
            "\n" +
            "9. לפני האפייה מסדרים את הג'חנונים בסיר הג'חנון. מרפדים את תחתית הסיר בנייר אפיה שהרטבנו מעט. אם יש אפשרות מומלץ להניח עליו שכבה של פרוסות לחם ולהרטיב קצת – זה עוזר למנוע מהשכבה התחתונה להתייבש, אבל זה לא חובה. מכסים את פרוסות הלחם בנייר אפייה רטוב נוסף ומתחילים לסדר את הג'חנונים בסיר. בין השכבות מניחים נייר אפייה רטוב, כדי למנוע מהג'חנונים להידבק זה לזה, וגם על השכבה העליונה. אפשר לסדר על השכבה העליונה ביצים קשות שבישלנו מראש כדי שישחימו במהלך האפייה.\n" +
            "\n" +
            "10. מכסים את הסיר ומכניסים לתנור שחומם ל-100 מעלות. אופים את הג'חנונים במשך כ-12 שעות. ניתן להוסיף מעט מים לסיר כשעתיים לפני ההגשה, כדי שיספגו עוד קצת לחות.\n" +
            "\n" +
            "11. ניתן להגיש עם רסק וביצה חומה." , "1. חותכים את העגבניות לקוביות גדולות: חותכים כל אחת לשלושה חלקים עבים, ואז כל חלק לארבע.\n" +
            "\n" +
            "2. פורסים את המלפפונים לעיגולים דקים.\n" +
            "\n" +
            "3.חוצים את הבצלים ואז קולפים במשיכה ובקלות. שמים את החצאים על צלחת ומחממים בעוצמה מלאה במיקרוגל במשך דקה. שוטפים במים קרים.\n" +
            "\n" +
            "4. חותכים את הפלפל לשבבים קטנים.\n" +
            "\n" +
            "5. שמים את כל הירקות בצלחת עם הזיתים והגבינה, בוזקים אורגנו ומטפטפים מעט שמן זית. אם מאוד רוצים, מוסיפים חסה, צלפים, גזר או שלושתם. בוזקים מלח, ושוב מזליפים מעט שמן זית.\n" +
            "\n" +
            "6. מגישים עם הרבה לחם לבן, כד לימונדה, מיכלי שמן זית וחומץ או לימון, וגם תוספת מלח, ומניחים לסועדים לתבל כמו שהם רוצים.\n" , "1. מכינים את המלית: מערבבים את כל החומרים יחד ולשים בידיים כדי שהתערובת תהיה אחידה וחום הידיים יחבר בין המרכיבים ויטמיע את הטעמים.\n" +
            "\n" +
            "2. מכינים את תפוחי האדמה למילוי: מקלפים ופורסים את תפוחי האדמה לפרוסות אחידות בעובי 3 ס\"מ. כל פרוסה כזאת חוצים לרוחב ומשאירים צד אחד מחובר (לקבלת מעין פה).\n" +
            "\n" +
            "3. ממלאים: יוצרים קציצות וממלאים כל כריך תפוח אדמה בקציצה. מהדקים את הצד החתוך.\n" +
            "\n" +
            "4. מכינים את הרוטב: מחממים שמן בסיר רחב ושטוח, מוסיפים בצל וסלרי ומאדים יחד 3 דקות. מוסיפים רסק עגבניות ומטגנים תוך כדי ערבוב בכף עץ. מוסיפים מרק או מים, תבלינים ופלפלצ'ומה. מערבבים, מכסים ומבשלים 10 דקות לקבלת רוטב.\n" +
            "\n" +
            "5. מחממים מחבת עם שמן לטיגון חצי עמוק, כמו לשניצל.\n" +
            "\n" +
            "6. מטגנים: מקמחים את כריכי תפוח האדמה, טובלים בביצה ומטגנים 2-3 דקות מכל צד עד להזהבה יפה.\n" +
            "\n" +
            "7.מבשלים: מניחים את תפוחי האדמה הממולאים והמטוגנים ברוטב, מכסים ומבשלים כשעה בחום נמוך – על הכיריים או בתנור. במידת הצורך מוסיפים עוד מרק או מים.","1.מחממים תנור ל-200 מעלות. מערבבים את הביצים, השמנת המתוקה, המלח והפלפל שחור לתערובת אחידה.\n" +
            "\n" +
            "2.משמנים מחבת בקוטר 22 ס\"מ שיכולה להיכנס לתנור ומניחים שני עלי פילו בתחתית. שני עלים נוספים שומרים בצד, לכיסוי.\n" +
            "\n" +
            "3.לוקחים עלה פילו מה-10 שנותרו, טובלים בתערובת השמנת והביצים ומכווצ'צ'ים אותו בידיים. מניחים במחבת. ממשיכים כך עם כל העלים.\n" +
            "\n" +
            "4.כשכל עלי הפילו מכווצ'צ'ים במחבת מפוררים עליהם וביניהם את הפטה. \n" +
            "\n" +
            "5.מניחים את שני דפי הפילו ששמרנו בצד מלמעלה, ומורחים אותם בשאריות תערובת הביצים והשמנת.\n" +
            "\n" +
            "6.מכניסים את המחבת לתנור ל-30-40 דקות, או עד שהמאפה שחום ופריך. אם רוצים שישחים גם מהצד השני הופכים אותו במחבת וצולים עוד 5 דקות ב-250 מעלות."};

    static String[] category1 = {"בשרי","איטלקי", "בשרי", "קינוח",
            "בשרי", "איטלקי", "ראשונות" , "בשרי" , "סלטים" , "קינוח" , "אסייתי", "אסייתי" , "איטלקי" , "ראשונות" ,"בשרי" ,"ראשונות" , "סלטים" , "בשרי","פשטידות"};


    static Integer[] image1 = {R.drawable.koba ,R.drawable.pizzabia, R.drawable.antricot, R.drawable.chocolatecake,
            R.drawable.burger, R.drawable.pastatomato, R.drawable.krovit, R.drawable.borekas, R.drawable.halomisalad, R.drawable.pancakes , R.drawable.tahilandwok , R.drawable.sushi , R.drawable.nioki , R.drawable.specialbread , R.drawable.chicken , R.drawable.janon , R.drawable.greecesalad , R.drawable.mafrom};


}
